jnow-87/foo/include/arch/avr/atmega1284_register.h
/**
 *	General Purpose Working Registes
 */
/* R1 */
// register
#define R1			0x1

/* R2 */
// register
#define R2			0x2

/* R3 */
// register
#define R3			0x3

/* R4 */
// register
#define R4			0x4

/* R5 */
// register
#define R5			0x5

/* R6 */
// register
#define R6			0x6

/* R7 */
// register
#define R7			0x7

/* R8 */
// register
#define R8			0x8

/* R9 */
// register
#define R9			0x9

/* R10 */
// register
#define R10			0xa

/* R11 */
// register
#define R11			0xb

/* R12 */
// register
#define R12			0xc

/* R13 */
// register
#define R13			0xd

/* R14 */
// register
#define R14			0xe

/* R15 */
// register
#define R15			0xf

/* R16 */
// register
#define R16			0x10

/* R17 */
// register
#define R17			0x11

/* R18 */
// register
#define R18			0x12

/* R19 */
// register
#define R19			0x13

/* R20 */
// register
#define R20			0x14

/* R21 */
// register
#define R21			0x15

/* R22 */
// register
#define R22			0x16

/* R23 */
// register
#define R23			0x17

/* R24 */
// register
#define R24			0x18

/* R25 */
// register
#define R25			0x19

/* R26 */
// register
#define R26			0x1a

/* R27 */
// register
#define R27			0x1b

/* R28 */
// register
#define R28			0x1c

/* R29 */
// register
#define R29			0x1d

/* R30 */
// register
#define R30			0x1e

/* R31 */
// register
#define R31			0x1f

/* X */
// register
#define X			0x1a

/* Y */
// register
#define Y			0x1c

/* Z */
// register
#define Z			0x1e

/**
 *	MCU General Control and Status
 */
/* MCUCR */
// register
#define MCUCR			0x55

// bits
#define MCUCR_JTD		7
#define MCUCR_BODS		6
#define MCUCR_BODSE		5
#define MCUCR_PUD		4
#define MCUCR_IVSEL		1
#define MCUCR_IVCE		0

// masks
#define MCUCR_JTD_MASK	0x1
#define MCUCR_BODS_MASK	0x1
#define MCUCR_BODSE_MASK	0x1
#define MCUCR_PUD_MASK	0x1
#define MCUCR_IVSEL_MASK	0x1
#define MCUCR_IVCE_MASK	0x1

/* MCUSR */
// register
#define MCUSR			0x54

// bits
#define MCUSR_JTRF		4
#define MCUSR_WDRF		3
#define MCUSR_BORF		2
#define MCUSR_EXTRF		1
#define MCUSR_PROF		0

// masks
#define MCUSR_JTRF_MASK	0x1
#define MCUSR_WDRF_MASK	0x1
#define MCUSR_BORF_MASK	0x1
#define MCUSR_EXTRF_MASK	0x1
#define MCUSR_PROF_MASK	0x1

/* SREG */
// register
#define SREG			0x5f

// bits
#define SREG_I		7
#define SREG_T		6
#define SREG_H		5
#define SREG_S		4
#define SREG_V		3
#define SREG_N		2
#define SREG_Z		1
#define SREG_C		0

// masks
#define SREG_I_MASK	0x1
#define SREG_T_MASK	0x1
#define SREG_H_MASK	0x1
#define SREG_S_MASK	0x1
#define SREG_V_MASK	0x1
#define SREG_N_MASK	0x1
#define SREG_Z_MASK	0x1
#define SREG_C_MASK	0x1

/* SPL */
// register
#define SPL			0x5d

// bits
#define SPL_VALUEL		0

// masks
#define SPL_VALUEL_MASK	0xff

/* SPH */
// register
#define SPH			0x5e

// bits
#define SPH_VALUEH		0

// masks
#define SPH_VALUEH_MASK	0xff

/* SMCR */
// register
#define SMCR			0x53

// bits
#define SMCR_SM		1
#define SMCR_SE		0

// masks
#define SMCR_SM_MASK	0x7
#define SMCR_SE_MASK	0x1

/* SPMCSR */
// register
#define SPMCSR			0x57

// bits
#define SPMCSR_SPMIE		7
#define SPMCSR_RWWSB		6
#define SPMCSR_SIGRD		5
#define SPMCSR_RWWSRE		4
#define SPMCSR_BLBSET		3
#define SPMCSR_PGWRT		2
#define SPMCSR_PGERS		1
#define SPMCSR_SPMEN		0

// masks
#define SPMCSR_SPMIE_MASK	0x1
#define SPMCSR_RWWSB_MASK	0x1
#define SPMCSR_SIGRD_MASK	0x1
#define SPMCSR_RWWSRE_MASK	0x1
#define SPMCSR_BLBSET_MASK	0x1
#define SPMCSR_PGWRT_MASK	0x1
#define SPMCSR_PGERS_MASK	0x0
#define SPMCSR_SPMEN_MASK	0x0

/* OCDR */
// register
#define OCDR			0x51

// bits
#define OCDR_VALUE		0

// masks
#define OCDR_VALUE_MASK	0xff

/* DDRA */
// register
#define DDRA			0x21

/* DDRB */
// register
#define DDRB			0x24

/* DDRC */
// register
#define DDRC			0x27

/* DDRD */
// register
#define DDRD			0x2a

/* PINA */
// register
#define PINA			0x20

/* PINB */
// register
#define PINB			0x23

/* PINC */
// register
#define PINC			0x26

/* PIND */
// register
#define PIND			0x29

/* PORTA */
// register
#define PORTA			0x22

/* PORTB */
// register
#define PORTB			0x25

/* PROTC */
// register
#define PROTC			0x28

/* PORTD */
// register
#define PORTD			0x2b

/* GPIOR0 */
// register
#define GPIOR0			0x3e

/* GPIOR1 */
// register
#define GPIOR1			0x4a

/* GPIOR2 */
// register
#define GPIOR2			0x4b

/* PCICR */
// register
#define PCICR			0x68

// bits
#define PCICR_PCIE3		3
#define PCICR_PCIE2		2
#define PCICR_PCIE1		1
#define PCICR_PCIE0		0

// masks
#define PCICR_PCIE3_MASK	0x1
#define PCICR_PCIE2_MASK	0x1
#define PCICR_PCIE1_MASK	0x1
#define PCICR_PCIE0_MASK	0x1

/* PCMSK0 */
// register
#define PCMSK0			0x6b

// bits
#define PCMSK0_PCINT7		7
#define PCMSK0_PCINT6		6
#define PCMSK0_PCINT5		5
#define PCMSK0_PCINT4		4
#define PCMSK0_PCINT3		3
#define PCMSK0_PCINT2		2
#define PCMSK0_PCINT1		1
#define PCMSK0_PCINT0		0

// masks
#define PCMSK0_PCINT7_MASK	0x1
#define PCMSK0_PCINT6_MASK	0x1
#define PCMSK0_PCINT5_MASK	0x1
#define PCMSK0_PCINT4_MASK	0x1
#define PCMSK0_PCINT3_MASK	0x1
#define PCMSK0_PCINT2_MASK	0x1
#define PCMSK0_PCINT1_MASK	0x1
#define PCMSK0_PCINT0_MASK	0x1

/* PCMSK1 */
// register
#define PCMSK1			0x6c

// bits
#define PCMSK1_PCINT15		7
#define PCMSK1_PCINT14		6
#define PCMSK1_PCINT13		5
#define PCMSK1_PCINT12		4
#define PCMSK1_PCINT11		3
#define PCMSK1_PCINT10		2
#define PCMSK1_PCINT9		1
#define PCMSK1_PCINT8		0

// masks
#define PCMSK1_PCINT15_MASK	0x1
#define PCMSK1_PCINT14_MASK	0x1
#define PCMSK1_PCINT13_MASK	0x1
#define PCMSK1_PCINT12_MASK	0x1
#define PCMSK1_PCINT11_MASK	0x1
#define PCMSK1_PCINT10_MASK	0x1
#define PCMSK1_PCINT9_MASK	0x1
#define PCMSK1_PCINT8_MASK	0x1

/* PCMSK2 */
// register
#define PCMSK2			0x6d

// bits
#define PCMSK2_PCINT23		7
#define PCMSK2_PCINT22		6
#define PCMSK2_PCINT21		5
#define PCMSK2_PCINT20		4
#define PCMSK2_PCINT19		3
#define PCMSK2_PCINT18		2
#define PCMSK2_PCINT17		1
#define PCMSK2_PCINT16		0

// masks
#define PCMSK2_PCINT23_MASK	0x1
#define PCMSK2_PCINT22_MASK	0x1
#define PCMSK2_PCINT21_MASK	0x1
#define PCMSK2_PCINT20_MASK	0x1
#define PCMSK2_PCINT19_MASK	0x1
#define PCMSK2_PCINT18_MASK	0x1
#define PCMSK2_PCINT17_MASK	0x1
#define PCMSK2_PCINT16_MASK	0x1

/* PCMSK3 */
// register
#define PCMSK3			0x73

// bits
#define PCMSK3_PCINT31		7
#define PCMSK3_PCINT30		6
#define PCMSK3_PCINT29		5
#define PCMSK3_PCINT28		4
#define PCMSK3_PCINT27		3
#define PCMSK3_PCINT26		2
#define PCMSK3_PCINT25		1
#define PCMSK3_PCINT24		0

// masks
#define PCMSK3_PCINT31_MASK	0x1
#define PCMSK3_PCINT30_MASK	0x1
#define PCMSK3_PCINT29_MASK	0x1
#define PCMSK3_PCINT28_MASK	0x1
#define PCMSK3_PCINT27_MASK	0x1
#define PCMSK3_PCINT26_MASK	0x1
#define PCMSK3_PCINT25_MASK	0x1
#define PCMSK3_PCINT24_MASK	0x1

