jnow-87/foo/include/arch/avr/atmega1284_register.h
/* PCIFR */
// register
#define PCIFR			0x3b

// bits
#define PCIFR_PCIF3		3
#define PCIFR_PCIF2		2
#define PCIFR_PCIF1		1
#define PCIFR_PCIF0		0

// masks
#define PCIFR_PCIF3_MASK	0x1
#define PCIFR_PCIF2_MASK	0x1
#define PCIFR_PCIF1_MASK	0x1
#define PCIFR_PCIF0_MASK	0x1

/* EICRA */
// register
#define EICRA			0x69

// bits
#define EICRA_ISC21		5
#define EICRA_ISC20		4
#define EICRA_ISC11		3
#define EICRA_ISC10		2
#define EICRA_ISC01		1
#define EICRA_ISC00		0

// masks
#define EICRA_ISC21_MASK	0x1
#define EICRA_ISC20_MASK	0x1
#define EICRA_ISC11_MASK	0x1
#define EICRA_ISC10_MASK	0x1
#define EICRA_ISC01_MASK	0x1
#define EICRA_ISC00_MASK	0x1

/* EIMSK */
// register
#define EIMSK			0x3d

// bits
#define EIMSK_INT2		2
#define EIMSK_INT1		1
#define EIMSK_INT0		0

// masks
#define EIMSK_INT2_MASK	0x1
#define EIMSK_INT1_MASK	0x1
#define EIMSK_INT0_MASK	0x1

/* EIFR */
// register
#define EIFR			0x3c

// bits
#define EIFR_INTF2		2
#define EIFR_INTF1		1
#define EIFR_INTF0		0

// masks
#define EIFR_INTF2_MASK	0x1
#define EIFR_INTF1_MASK	0x1
#define EIFR_INTF0_MASK	0x1

/* CLKPR */
// register
#define CLKPR			0x61

// bits
#define CLKPR_CLKPCE		7
#define CLKPR_CLKPS		0

// masks
#define CLKPR_CLKPCE_MASK	0x1
#define CLKPR_CLKPS_MASK	0xf

/* OSCCAL */
// register
#define OSCCAL			0x66

// bits
#define OSCCAL_VALUE		0

// masks
#define OSCCAL_VALUE_MASK	0xff

/* PRR0 */
// register
#define PRR0			0x64

// bits
#define PRR0_PRTWI		7
#define PRR0_PRTIM2		6
#define PRR0_PRTIM0		5
#define PRR0_PRUSART1		4
#define PRR0_PRTIM1		3
#define PRR0_PRSPI		2
#define PRR0_PRUSART0		1
#define PRR0_PRADC		0

// masks
#define PRR0_PRTWI_MASK	0x1
#define PRR0_PRTIM2_MASK	0x1
#define PRR0_PRTIM0_MASK	0x1
#define PRR0_PRUSART1_MASK	0x1
#define PRR0_PRTIM1_MASK	0x1
#define PRR0_PRSPI_MASK	0x1
#define PRR0_PRUSART0_MASK	0x1
#define PRR0_PRADC_MASK	0x1

/* PRR1 */
// register
#define PRR1			0x65

// bits
#define PRR1_PRTIM3		0

// masks
#define PRR1_PRTIM3_MASK	0x1

/* WDTCSR */
// register
#define WDTCSR			0x60

// bits
#define WDTCSR_WDIF		7
#define WDTCSR_WDIE		6
#define WDTCSR_WDP3		5
#define WDTCSR_WDCE		4
#define WDTCSR_WDE		3
#define WDTCSR_WDP2		2
#define WDTCSR_WDP1		1
#define WDTCSR_WDP0		0

// masks
#define WDTCSR_WDIF_MASK	0x1
#define WDTCSR_WDIE_MASK	0x1
#define WDTCSR_WDP3_MASK	0x1
#define WDTCSR_WDCE_MASK	0x1
#define WDTCSR_WDE_MASK	0x1
#define WDTCSR_WDP2_MASK	0x1
#define WDTCSR_WDP1_MASK	0x1
#define WDTCSR_WDP0_MASK	0x1

/**
 *	Universal Synchronous and Asynchronous Serial Receiver and Transmitter (USART)
 */
/* UCSR0A */
// register
#define UCSR0A			0xc0

// bits
#define UCSR0A_RXC		7
#define UCSR0A_TXC		6
#define UCSR0A_UDRE		5
#define UCSR0A_FE		4
#define UCSR0A_DOR		3
#define UCSR0A_UPE		2
#define UCSR0A_U2X		1
#define UCSR0A_MPCM		0

// masks
#define UCSR0A_RXC_MASK	0x1
#define UCSR0A_TXC_MASK	0x1
#define UCSR0A_UDRE_MASK	0x1
#define UCSR0A_FE_MASK	0x1
#define UCSR0A_DOR_MASK	0x1
#define UCSR0A_UPE_MASK	0x1
#define UCSR0A_U2X_MASK	0x1
#define UCSR0A_MPCM_MASK	0x1

/* UCSR0B */
// register
#define UCSR0B			0xc1

// bits
#define UCSR0B_RXCIE		7
#define UCSR0B_TXCIE		6
#define UCSR0B_UDRIE		5
#define UCSR0B_RXEN		4
#define UCSR0B_TXEN		3
#define UCSR0B_UCSZ2		2
#define UCSR0B_RXB8		1
#define UCSR0B_TXB8		0

// masks
#define UCSR0B_RXCIE_MASK	0x1
#define UCSR0B_TXCIE_MASK	0x1
#define UCSR0B_UDRIE_MASK	0x1
#define UCSR0B_RXEN_MASK	0x1
#define UCSR0B_TXEN_MASK	0x1
#define UCSR0B_UCSZ2_MASK	0x1
#define UCSR0B_RXB8_MASK	0x1
#define UCSR0B_TXB8_MASK	0x1

/* UCSR0C */
// register
#define UCSR0C			0xc2

// bits
#define UCSR0C_UMSEL1		7
#define UCSR0C_UMSEL0		6
#define UCSR0C_UPM1		5
#define UCSR0C_UPM0		4
#define UCSR0C_USBS		3
#define UCSR0C_UCSZ1		2
#define UCSR0C_UCSZ0		1
#define UCSR0C_UCPOL		0

// masks
#define UCSR0C_UMSEL1_MASK	0x1
#define UCSR0C_UMSEL0_MASK	0x1
#define UCSR0C_UPM1_MASK	0x1
#define UCSR0C_UPM0_MASK	0x1
#define UCSR0C_USBS_MASK	0x1
#define UCSR0C_UCSZ1_MASK	0x1
#define UCSR0C_UCSZ0_MASK	0x1
#define UCSR0C_UCPOL_MASK	0x1

/* UBRR0L */
// register
#define UBRR0L			0xc4

// bits
#define UBRR0L_Low		0

// masks
#define UBRR0L_Low_MASK	0xff

/* UBRR0H */
// register
#define UBRR0H			0xc5

// bits
#define UBRR0H_High		0

// masks
#define UBRR0H_High_MASK	0xf

/* UDR0 */
// register
#define UDR0			0xc6

// bits
#define UDR0_Data		0

// masks
#define UDR0_Data_MASK	0xff

/* UCSR1A */
// register
#define UCSR1A			0xc8

// bits
#define UCSR1A_RXC		7
#define UCSR1A_TXC		6
#define UCSR1A_UDRE		5
#define UCSR1A_FE		4
#define UCSR1A_DOR		3
#define UCSR1A_UPE		2
#define UCSR1A_U2X		1
#define UCSR1A_MPCM		0

// masks
#define UCSR1A_RXC_MASK	0x1
#define UCSR1A_TXC_MASK	0x1
#define UCSR1A_UDRE_MASK	0x1
#define UCSR1A_FE_MASK	0x1
#define UCSR1A_DOR_MASK	0x1
#define UCSR1A_UPE_MASK	0x1
#define UCSR1A_U2X_MASK	0x1
#define UCSR1A_MPCM_MASK	0x1

/* UCSR1B */
// register
#define UCSR1B			0xc9

// bits
#define UCSR1B_RXCIE		7
#define UCSR1B_TXCIE		6
#define UCSR1B_UDRIE		5
#define UCSR1B_RXEN		4
#define UCSR1B_TXEN		3
#define UCSR1B_UCSZ2		2
#define UCSR1B_RXB8		1
#define UCSR1B_TXB8		0

// masks
#define UCSR1B_RXCIE_MASK	0x1
#define UCSR1B_TXCIE_MASK	0x1
#define UCSR1B_UDRIE_MASK	0x1
#define UCSR1B_RXEN_MASK	0x1
#define UCSR1B_TXEN_MASK	0x1
#define UCSR1B_UCSZ2_MASK	0x1
#define UCSR1B_RXB8_MASK	0x1
#define UCSR1B_TXB8_MASK	0x1

/* UCSR1C */
// register
#define UCSR1C			0xca

// bits
#define UCSR1C_UMSEL1		7
#define UCSR1C_UMSEL0		6
#define UCSR1C_UPM1		5
#define UCSR1C_UPM0		4
#define UCSR1C_USBS		3
#define UCSR1C_UCSZ1		2
#define UCSR1C_UCSZ0		1
#define UCSR1C_UCPOL		0

// masks
#define UCSR1C_UMSEL1_MASK	0x1
#define UCSR1C_UMSEL0_MASK	0x1
#define UCSR1C_UPM1_MASK	0x1
#define UCSR1C_UPM0_MASK	0x1
#define UCSR1C_USBS_MASK	0x1
#define UCSR1C_UCSZ1_MASK	0x1
#define UCSR1C_UCSZ0_MASK	0x1
#define UCSR1C_UCPOL_MASK	0x1

/* UBRR1L */
// register
#define UBRR1L			0xcc

// bits
#define UBRR1L_Low		0

// masks
#define UBRR1L_Low_MASK	0xff

/* UBRR1H */
// register
#define UBRR1H			0xcd

// bits
#define UBRR1H_High		0

// masks
#define UBRR1H_High_MASK	0xf

