jnow-87/foo/include/arch/avr/atmega1284_register.h
/* UDR1 */
// register
#define UDR1			0xce

// bits
#define UDR1_Data		0

// masks
#define UDR1_Data_MASK	0xff

/**
 *	Two Wire Interface (TWI)
 */
/* TWCR */
// register
#define TWCR			0xbc

// bits
#define TWCR_TWINT		7
#define TWCR_TWEA		6
#define TWCR_TWSTA		5
#define TWCR_TWSTO		4
#define TWCR_TWWC		3
#define TWCR_TWEN		2
#define TWCR_TWIE		0

// masks
#define TWCR_TWINT_MASK	0x1
#define TWCR_TWEA_MASK	0x1
#define TWCR_TWSTA_MASK	0x1
#define TWCR_TWSTO_MASK	0x1
#define TWCR_TWWC_MASK	0x1
#define TWCR_TWEN_MASK	0x1
#define TWCR_TWIE_MASK	0x1

/* TWSR */
// register
#define TWSR			0xb9

// bits
#define TWSR_TWS7		7
#define TWSR_TWS6		6
#define TWSR_TWS5		5
#define TWSR_TWS4		4
#define TWSR_TWS3		3
#define TWSR_TWPS1		1
#define TWSR_TWPS0		0

// masks
#define TWSR_TWS7_MASK	0x1
#define TWSR_TWS6_MASK	0x1
#define TWSR_TWS5_MASK	0x1
#define TWSR_TWS4_MASK	0x1
#define TWSR_TWS3_MASK	0x1
#define TWSR_TWPS1_MASK	0x1
#define TWSR_TWPS0_MASK	0x1

/* TWDR */
// register
#define TWDR			0xbb

// bits
#define TWDR_Data		0

// masks
#define TWDR_Data_MASK	0xff

/* TWBR */
// register
#define TWBR			0xb8

// bits
#define TWBR_BR		0

// masks
#define TWBR_BR_MASK	0xff

/* TWAR */
// register
#define TWAR			0xba

// bits
#define TWAR_TWA		1
#define TWAR_TWGCE		0

// masks
#define TWAR_TWA_MASK	0x7f
#define TWAR_TWGCE_MASK	0x1

/* TWAMR */
// register
#define TWAMR			0xbd

// bits
#define TWAMR_TWAM		1

// masks
#define TWAMR_TWAM_MASK	0x7f

/**
 *	Serial Peripheral Interface (SPI)
 */
/* SPCR */
// register
#define SPCR			0x4c

// bits
#define SPCR_SPIE0		7
#define SPCR_SPE0		6
#define SPCR_DORD0		5
#define SPCR_MSTR0		4
#define SPCR_CPOL0		3
#define SPCR_CPHA0		2
#define SPCR_SPR0		0

// masks
#define SPCR_SPIE0_MASK	0x1
#define SPCR_SPE0_MASK	0x1
#define SPCR_DORD0_MASK	0x1
#define SPCR_MSTR0_MASK	0x1
#define SPCR_CPOL0_MASK	0x1
#define SPCR_CPHA0_MASK	0x1
#define SPCR_SPR0_MASK	0x3

/* SPSR */
// register
#define SPSR			0x4d

// bits
#define SPSR_SPIF0		7
#define SPSR_WCOL0		6
#define SPSR_SPI2X0		0

// masks
#define SPSR_SPIF0_MASK	0x1
#define SPSR_WCOL0_MASK	0x1
#define SPSR_SPI2X0_MASK	0x1

/* SPDR */
// register
#define SPDR			0x4e

// bits
#define SPDR_DATA		0

// masks
#define SPDR_DATA_MASK	0xff

/**
 *	Timer/Counter 0 (8-bit)
 */
/* TCCR0A */
// register
#define TCCR0A			0x44

// bits
#define TCCR0A_COMA		6
#define TCCR0A_COMB		4
#define TCCR0A_WGM1		1
#define TCCR0A_WGM0		0

// masks
#define TCCR0A_COMA_MASK	0x3
#define TCCR0A_COMB_MASK	0x3
#define TCCR0A_WGM1_MASK	0x1
#define TCCR0A_WGM0_MASK	0x1

/* TCCR0B */
// register
#define TCCR0B			0x45

// bits
#define TCCR0B_FOCA		7
#define TCCR0B_FOCB		6
#define TCCR0B_WGM2		3
#define TCCR0B_CS		0

// masks
#define TCCR0B_FOCA_MASK	0x1
#define TCCR0B_FOCB_MASK	0x1
#define TCCR0B_WGM2_MASK	0x1
#define TCCR0B_CS_MASK	0x7

/* TCNT0 */
// register
#define TCNT0			0x46

// bits
#define TCNT0_CNT		0

// masks
#define TCNT0_CNT_MASK	0xff

/* OCR0A */
// register
#define OCR0A			0x47

// bits
#define OCR0A_VALUE		0

// masks
#define OCR0A_VALUE_MASK	0xff

/* OCR0B */
// register
#define OCR0B			0x48

// bits
#define OCR0B_VALUE		0

// masks
#define OCR0B_VALUE_MASK	0xff

/* TIMSK0 */
// register
#define TIMSK0			0x6e

// bits
#define TIMSK0_OCIE0B		2
#define TIMSK0_OCIE0A		1
#define TIMSK0_TOIE0		0

// masks
#define TIMSK0_OCIE0B_MASK	0x1
#define TIMSK0_OCIE0A_MASK	0x1
#define TIMSK0_TOIE0_MASK	0x1

/* TIFR0 */
// register
#define TIFR0			0x35

// bits
#define TIFR0_OCF0B		2
#define TIFR0_OCF0A		1
#define TIFR0_TOV0		0

// masks
#define TIFR0_OCF0B_MASK	0x1
#define TIFR0_OCF0A_MASK	0x1
#define TIFR0_TOV0_MASK	0x1

/**
 *	Timer/Counter 1 (16-bit)
 */
/* TCCR1A */
// register
#define TCCR1A			0x80

// bits
#define TCCR1A_COMA		6
#define TCCR1A_COMB		4
#define TCCR1A_WGM1		1
#define TCCR1A_WGM0		0

// masks
#define TCCR1A_COMA_MASK	0x3
#define TCCR1A_COMB_MASK	0x3
#define TCCR1A_WGM1_MASK	0x1
#define TCCR1A_WGM0_MASK	0x1

/* TCCR1B */
// register
#define TCCR1B			0x81

// bits
#define TCCR1B_ICNC		7
#define TCCR1B_ICES		6
#define TCCR1B_WGM3		4
#define TCCR1B_WGM2		3
#define TCCR1B_CS		0

// masks
#define TCCR1B_ICNC_MASK	0x1
#define TCCR1B_ICES_MASK	0x1
#define TCCR1B_WGM3_MASK	0x1
#define TCCR1B_WGM2_MASK	0x1
#define TCCR1B_CS_MASK	0x7

/* TCCR1C */
// register
#define TCCR1C			0x82

// bits
#define TCCR1C_FOCA		7
#define TCCR1C_FOCB		6

// masks
#define TCCR1C_FOCA_MASK	0x1
#define TCCR1C_FOCB_MASK	0x1

/* TCNT1L */
// register
#define TCNT1L			0x84

// bits
#define TCNT1L_CNTL		0

// masks
#define TCNT1L_CNTL_MASK	0xff

/* TCNT1H */
// register
#define TCNT1H			0x85

// bits
#define TCNT1H_CNTH		0

// masks
#define TCNT1H_CNTH_MASK	0xff

/* ICR1L */
// register
#define ICR1L			0x86

// bits
#define ICR1L_VALUEL		0

// masks
#define ICR1L_VALUEL_MASK	0xff

/* ICR1H */
// register
#define ICR1H			0x87

// bits
#define ICR1H_VALUEH		0

// masks
#define ICR1H_VALUEH_MASK	0xff

/* OCR1AL */
// register
#define OCR1AL			0x88

// bits
#define OCR1AL_VALUEL		0

// masks
#define OCR1AL_VALUEL_MASK	0xff

/* OCR1AH */
// register
#define OCR1AH			0x89

// bits
#define OCR1AH_VALUEH		0

// masks
#define OCR1AH_VALUEH_MASK	0xff

/* OCR1BL */
// register
#define OCR1BL			0x8a

// bits
#define OCR1BL_VALUEL		0

// masks
#define OCR1BL_VALUEL_MASK	0xff

/* OCR1BH */
// register
#define OCR1BH			0x8b

// bits
#define OCR1BH_VALUEH		0

// masks
#define OCR1BH_VALUEH_MASK	0xff

/* TIMSK1 */
// register
#define TIMSK1			0x6f

// bits
#define TIMSK1_ICIE1		5
#define TIMSK1_OCIE1B		2
#define TIMSK1_OCIE1A		1
#define TIMSK1_TOIE1		0

// masks
#define TIMSK1_ICIE1_MASK	0x1
#define TIMSK1_OCIE1B_MASK	0x1
#define TIMSK1_OCIE1A_MASK	0x1
#define TIMSK1_TOIE1_MASK	0x1

/* TIFR1 */
// register
#define TIFR1			0x36

// bits
#define TIFR1_ICF1		5
#define TIFR1_OCF1B		2
#define TIFR1_OCF1A		1
#define TIFR1_TOV1		0

// masks
#define TIFR1_ICF1_MASK	0x1
#define TIFR1_OCF1B_MASK	0x1
#define TIFR1_OCF1A_MASK	0x1
#define TIFR1_TOV1_MASK	0x1

/**
 *	Timer/Counter 2 (8-bit)
 */
/* TCCR2A */
// register
#define TCCR2A			0xb0

// bits
#define TCCR2A_COMA		6
#define TCCR2A_COMB		4
#define TCCR2A_WGM1		1
#define TCCR2A_WGM0		0

// masks
#define TCCR2A_COMA_MASK	0x3
#define TCCR2A_COMB_MASK	0x3
#define TCCR2A_WGM1_MASK	0x1
#define TCCR2A_WGM0_MASK	0x1

