jnow-87/foo/include/arch/avr/atmega1284_register.h
/* TCCR2B */
// register
#define TCCR2B			0xb1

// bits
#define TCCR2B_FOCA		7
#define TCCR2B_FOCB		6
#define TCCR2B_WGM2		3
#define TCCR2B_CS		0

// masks
#define TCCR2B_FOCA_MASK	0x1
#define TCCR2B_FOCB_MASK	0x1
#define TCCR2B_WGM2_MASK	0x1
#define TCCR2B_CS_MASK	0x7

/* TCNT2 */
// register
#define TCNT2			0xb2

// bits
#define TCNT2_CNT		0

// masks
#define TCNT2_CNT_MASK	0xff

/* OCR2A */
// register
#define OCR2A			0xb3

// bits
#define OCR2A_VALUE		0

// masks
#define OCR2A_VALUE_MASK	0xff

/* OCR2B */
// register
#define OCR2B			0xb4

// bits
#define OCR2B_VALUE		0

// masks
#define OCR2B_VALUE_MASK	0xff

/* ASSR */
// register
#define ASSR			0xb6

// bits
#define ASSR_EXCLK		6
#define ASSR_AS2		5
#define ASSR_TCNUB		4
#define ASSR_OCRAUB		3
#define ASSR_OCRBUB		2
#define ASSR_TCRAUB		1
#define ASSR_TCRBUB		0

// masks
#define ASSR_EXCLK_MASK	0x1
#define ASSR_AS2_MASK	0x1
#define ASSR_TCNUB_MASK	0x1
#define ASSR_OCRAUB_MASK	0x1
#define ASSR_OCRBUB_MASK	0x1
#define ASSR_TCRAUB_MASK	0x1
#define ASSR_TCRBUB_MASK	0x1

/* GTCCR */
// register
#define GTCCR			0x43

// bits
#define GTCCR_TSM		7
#define GTCCR_PSRASY		1
#define GTCCR_PSRSYNC		0

// masks
#define GTCCR_TSM_MASK	0x1
#define GTCCR_PSRASY_MASK	0x1
#define GTCCR_PSRSYNC_MASK	0x1

/* TIMSK2 */
// register
#define TIMSK2			0x70

// bits
#define TIMSK2_OCIE2B		2
#define TIMSK2_OCIE2A		1
#define TIMSK2_TOIE2		0

// masks
#define TIMSK2_OCIE2B_MASK	0x1
#define TIMSK2_OCIE2A_MASK	0x1
#define TIMSK2_TOIE2_MASK	0x1

/* TIFR2 */
// register
#define TIFR2			0x37

// bits
#define TIFR2_OCF2B		2
#define TIFR2_OCF2A		1
#define TIFR2_TOV2		0

// masks
#define TIFR2_OCF2B_MASK	0x1
#define TIFR2_OCF2A_MASK	0x1
#define TIFR2_TOV2_MASK	0x1

/**
 *	Timer/Counter 3 (16-bit)
 */
/* TCCR3A */
// register
#define TCCR3A			0x90

// bits
#define TCCR3A_COMA		6
#define TCCR3A_COMB		4
#define TCCR3A_WGM1		1
#define TCCR3A_WGM0		0

// masks
#define TCCR3A_COMA_MASK	0x3
#define TCCR3A_COMB_MASK	0x3
#define TCCR3A_WGM1_MASK	0x1
#define TCCR3A_WGM0_MASK	0x1

/* TCCR3B */
// register
#define TCCR3B			0x91

// bits
#define TCCR3B_ICNC		7
#define TCCR3B_ICES		6
#define TCCR3B_WGM3		4
#define TCCR3B_WGM2		3
#define TCCR3B_CS		0

// masks
#define TCCR3B_ICNC_MASK	0x1
#define TCCR3B_ICES_MASK	0x1
#define TCCR3B_WGM3_MASK	0x1
#define TCCR3B_WGM2_MASK	0x1
#define TCCR3B_CS_MASK	0x7

/* TCCR3C */
// register
#define TCCR3C			0x92

// bits
#define TCCR3C_FOCA		7
#define TCCR3C_FOCB		6

// masks
#define TCCR3C_FOCA_MASK	0x1
#define TCCR3C_FOCB_MASK	0x1

/* TCNT3L */
// register
#define TCNT3L			0x94

// bits
#define TCNT3L_CNTL		0

// masks
#define TCNT3L_CNTL_MASK	0xff

/* TCNT3H */
// register
#define TCNT3H			0x95

// bits
#define TCNT3H_CNTH		0

// masks
#define TCNT3H_CNTH_MASK	0xff

/* ICR3L */
// register
#define ICR3L			0x96

// bits
#define ICR3L_VALUEL		0

// masks
#define ICR3L_VALUEL_MASK	0xff

/* ICR3H */
// register
#define ICR3H			0x97

// bits
#define ICR3H_VALUEH		0

// masks
#define ICR3H_VALUEH_MASK	0xff

/* OCR3AL */
// register
#define OCR3AL			0x98

// bits
#define OCR3AL_VALUEL		0

// masks
#define OCR3AL_VALUEL_MASK	0xff

/* OCR3AH */
// register
#define OCR3AH			0x99

// bits
#define OCR3AH_VALUEH		0

// masks
#define OCR3AH_VALUEH_MASK	0xff

/* OCR3BL */
// register
#define OCR3BL			0x9a

// bits
#define OCR3BL_VALUEL		0

// masks
#define OCR3BL_VALUEL_MASK	0xff

/* OCR3BH */
// register
#define OCR3BH			0x9b

// bits
#define OCR3BH_VALUEH		0

// masks
#define OCR3BH_VALUEH_MASK	0xff

/* TIMSK3 */
// register
#define TIMSK3			0x71

// bits
#define TIMSK3_ICIE3		5
#define TIMSK3_OCIE3B		2
#define TIMSK3_OCIE3A		1
#define TIMSK3_TOIE3		0

// masks
#define TIMSK3_ICIE3_MASK	0x1
#define TIMSK3_OCIE3B_MASK	0x1
#define TIMSK3_OCIE3A_MASK	0x1
#define TIMSK3_TOIE3_MASK	0x1

/* TIFR3 */
// register
#define TIFR3			0x38

// bits
#define TIFR3_ICF3		5
#define TIFR3_OCF3B		2
#define TIFR3_OCF3A		1
#define TIFR3_TOV3		0

// masks
#define TIFR3_ICF3_MASK	0x1
#define TIFR3_OCF3B_MASK	0x1
#define TIFR3_OCF3A_MASK	0x1
#define TIFR3_TOV3_MASK	0x1

/**
 *	Analog Comparator and Digital Converter
 */
/* ADCL */
// register
#define ADCL			0x78

// bits
#define ADCL_DATAL		0

// masks
#define ADCL_DATAL_MASK	0xff

/* ADCH */
// register
#define ADCH			0x79

// bits
#define ADCH_DATAH		0

// masks
#define ADCH_DATAH_MASK	0xff

/* ADCSRA */
// register
#define ADCSRA			0x7a

// bits
#define ADCSRA_ADEN		7
#define ADCSRA_ADSC		6
#define ADCSRA_ADATE		5
#define ADCSRA_ADIF		4
#define ADCSRA_ADIE		3
#define ADCSRA_ADPS		0

// masks
#define ADCSRA_ADEN_MASK	0x1
#define ADCSRA_ADSC_MASK	0x1
#define ADCSRA_ADATE_MASK	0x1
#define ADCSRA_ADIF_MASK	0x1
#define ADCSRA_ADIE_MASK	0x1
#define ADCSRA_ADPS_MASK	0x7

/* ADCSRB */
// register
#define ADCSRB			0x7b

// bits
#define ADCSRB_ACME		6
#define ADCSRB_ADTS		0

// masks
#define ADCSRB_ACME_MASK	0x1
#define ADCSRB_ADTS_MASK	0x7

/* ADMUX */
// register
#define ADMUX			0x7c

// bits
#define ADMUX_REFS1		7
#define ADMUX_REFS0		6
#define ADMUX_ADLAR		5
#define ADMUX_MUX4		4
#define ADMUX_MUX3		3
#define ADMUX_MUX2		2
#define ADMUX_MUX1		1
#define ADMUX_MUX0		0

// masks
#define ADMUX_REFS1_MASK	0x1
#define ADMUX_REFS0_MASK	0x1
#define ADMUX_ADLAR_MASK	0x1
#define ADMUX_MUX4_MASK	0x1
#define ADMUX_MUX3_MASK	0x1
#define ADMUX_MUX2_MASK	0x1
#define ADMUX_MUX1_MASK	0x1
#define ADMUX_MUX0_MASK	0x1

/* DIDR0 */
// register
#define DIDR0			0x7e

// bits
#define DIDR0_ADC7D		7
#define DIDR0_ADC6D		6
#define DIDR0_ADC5D		5
#define DIDR0_ADC4D		4
#define DIDR0_ADC3D		3
#define DIDR0_ADC2D		2
#define DIDR0_ADC1D		1
#define DIDR0_ADC0D		0

// masks
#define DIDR0_ADC7D_MASK	0x1
#define DIDR0_ADC6D_MASK	0x1
#define DIDR0_ADC5D_MASK	0x1
#define DIDR0_ADC4D_MASK	0x1
#define DIDR0_ADC3D_MASK	0x1
#define DIDR0_ADC2D_MASK	0x1
#define DIDR0_ADC1D_MASK	0x1
#define DIDR0_ADC0D_MASK	0x1

/* DIDR1 */
// register
#define DIDR1			0x7f

// bits
#define DIDR1_AIN1D		1
#define DIDR1_AIN0D		0

// masks
#define DIDR1_AIN1D_MASK	0x1
#define DIDR1_AIN0D_MASK	0x1

/* ACSR */
// register
#define ACSR			0x50

// bits
#define ACSR_ACD		7
#define ACSR_ACBG		6
#define ACSR_ACO		5
#define ACSR_ACI		4
#define ACSR_ACIE		3
#define ACSR_ACIC		2
#define ACSR_ACIS		0

// masks
#define ACSR_ACD_MASK	0x1
#define ACSR_ACBG_MASK	0x1
#define ACSR_ACO_MASK	0x1
#define ACSR_ACI_MASK	0x1
#define ACSR_ACIE_MASK	0x1
#define ACSR_ACIC_MASK	0x1
#define ACSR_ACIS_MASK	0x3

/**
 *	Electrically Erasable Programmable Read-Only Memory (EEPROM)
 */
/* EECR */
// register
#define EECR			0x3f

// bits
#define EECR_EEPM1		5
#define EECR_EEPM0		4
#define EECR_EERIE		3
#define EECR_EEMPE		2
#define EECR_EEPE		1
#define EECR_EERE		0

// masks
#define EECR_EEPM1_MASK	0x1
#define EECR_EEPM0_MASK	0x1
#define EECR_EERIE_MASK	0x1
#define EECR_EEMPE_MASK	0x1
#define EECR_EEPE_MASK	0x1
#define EECR_EERE_MASK	0x1

/* EEDR */
// register
#define EEDR			0x40

// bits
#define EEDR_DATA		0

// masks
#define EEDR_DATA_MASK	0xff

/* EEARL */
// register
#define EEARL			0x41

// bits
#define EEARL_ADDRL		0

// masks
#define EEARL_ADDRL_MASK	0xff

/* EEARH */
// register
#define EEARH			0x42

// bits
#define EEARH_ADDRH		0

// masks
#define EEARH_ADDRH_MASK	0xf

